In [3]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt

In [4]:
obj = pd.Series(np.arange(5),index=['a','b','c','d','e'])

In [5]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [6]:
 obj['b']

1

In [8]:
obj[3]

3

In [9]:
obj[2:4]

c    2
d    3
dtype: int64

In [10]:
obj[['b','a']]

b    1
a    0
dtype: int64

In [11]:
obj[obj>2]

d    3
e    4
dtype: int64

In [12]:
obj > 2

a    False
b    False
c    False
d     True
e     True
dtype: bool

In [13]:
obj['b':'c']

b    1
c    2
dtype: int64

In [14]:
obj['a':'d']

a    0
b    1
c    2
d    3
dtype: int64

In [15]:
obj['b':'c']  = 99

In [16]:
obj

a     0
b    99
c    99
d     3
e     4
dtype: int64

In [17]:

data = pd.DataFrame(np.arange(16).reshape(4,4) , 
	index = ['Ohio','Colorado','Utah','New York'],
	columns = ['one','two','three','four']
	)

In [18]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [19]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [20]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [21]:
data[0:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [22]:
data['three'] > 5

Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool

In [23]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [24]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [25]:
data[data<5] = 0

In [26]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

## 5.2.3.1 使用 loc iloc 选择数据

In [27]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int64

In [28]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [32]:
data.iloc[2,:3]

one       8
two       9
three    10
Name: Utah, dtype: int64

In [33]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [34]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [37]:
data.loc[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [38]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [39]:
data.iloc[:,:3]

          one  two  three
Ohio        0    0      0
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [40]:
data.iloc[:,:3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

    DataFrame 索引选项
    类型        描述
    df[val]      从DataFrame 中选择单列或列序号, 特殊情况的遍历 布尔数组(过滤行) 切片(切片行) 或布尔值DataFrame (根据某些标准设定的值)
    df.loc[]     根据标签选择 dataframe的单行或者多行
    df.loc[:,val]  根据标签选择单列 或者 多列
    df.loc[val1,val2] 根据标签 选择 行 和 列 中的一部分
    
    df.iloc[where]  根据整数位置选择单行或多行
    df.iloc[:, where] 根据整数位置  选择 单列或多列
    df.iloc[where_i,where_j]  根据整数位置 选择行和列
    df.at[label_i,lable_j] 根据行 列标签选择单个 标量值
    df.at[i,j] 根据行列 整数位置 选择单个标量值
    df.iat[i,j] 根据 行列 整数位置 选择单个标量值
    reindex 方法  通过 标签选择行和列
    get_value set_value 方法 根据行和列的标签 设置单个值